messages = {
    "en": "Hello, this is a courtesy reminder from Manappuram Gold. Your monthly EMI is due for payment. Please make the payment at the earliest to avoid penalties or service interruptions. If already paid, kindly ignore this message. Thank you for banking with Manappuram Gold.",
    "te": "నమస్కారం, ఇది మనప్పురం గోల్డ్ నుండి రిమైండర్ కాల్. మీ నెలవారీ EMI చెల్లించాల్సి ఉంది. దయచేసి వీలైనంత త్వరగా చెల్లించి, జరిమానా తప్పించుకోండి. మీరు ఇప్పటికే చెల్లించి ఉంటే, ఈ సందేశాన్ని విస్మరించండి. మనప్పురం గోల్డ్ ను ఎంచుకున్నందుకు ధన్యవాదాలు.",
    "ta": "வணக்கம், இது மணப்புரம் கோல்ட் சார்பில் நினைவூட்டும் அழைப்பு. உங்கள் மாத தவணை EMI செலுத்த வேண்டியுள்ளது. தயவுசெய்து உடனே செலுத்தி அபராதத்தை தவிர்க்கவும். நீங்கள் ஏற்கனவே செலுத்தியிருந்தால், இந்த செய்தியை புறக்கணிக்கவும். மணப்புரம் கோல்டை தேர்ந்தெடுத்ததற்கு நன்றி.",
    "ma": "നമസ്കാരം, ഇത് മണപ്പുറം ഗോൾഡ് നിന്നുള്ള ഓർമ്മപ്പെടുത്തൽ കോൾ ആണ്. നിങ്ങളുടെ മാസാന്ത EMI അടയ്ക്കാനുള്ളതാണ്. ദയവായി ഉടൻ അടയ്ക്കുക, പിഴ ഒഴിവാക്കാൻ. നിങ്ങൾ ഇതിനകം അടച്ചിട്ടുണ്ടെങ്കിൽ, ഈ സന്ദേശം അവഗണിക്കാം. മണപ്പുറം ഗോൾഡ് തിരഞ്ഞെടുക്കുന്നതിന് നന്ദി.",
    "ka": "ನಮಸ್ಕಾರ, ಇದು ಮಣಪ್ಪುರಂ ಗೋಲ್ಡ್ ನಿಂದ ಸ್ಮರಣಿಕೆ ಕರೆ. ನಿಮ್ಮ ಮಾಸಿಕ EMI ಪಾವತಿಸಬೇಕಾಗಿದೆ. ದಯವಿಟ್ಟು ತಕ್ಷಣ ಪಾವತಿಸಿ ದಂಡವನ್ನು ತಪ್ಪಿಸಿಕೊಳ್ಳಿ. ನೀವು ಈಗಾಗಲೇ ಪಾವತಿಸಿದ್ದರೆ, ಈ ಸಂದೇಶವನ್ನು ನಿರ್ಲಕ್ಷಿಸಿ. ಮಣಪ್ಪುರಂ ಗೋಲ್ಡ್ ಆಯ್ಕೆ ಮಾಡಿದಕ್ಕಾಗಿ ಧನ್ಯವಾದಗಳು."
}

language_map = {
    "en":"English",
    "te":"Telugu",
    "ta":"Tamil",
    "ma":"Malayalam",
    "ka":"Kannada"
}